Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData.TotalConnectedCurrent
The total connected current of the analytical power source.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData.Voltage
The voltage value of the analytical power source.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for voltage is not a number
-or-
When setting this property: The given value for voltage is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for voltage must be positive.
Since:
2023

Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData
Represents the data and parameters of analytical power source node.
Since:
2023